app/views/books/edit.html.erb

<p><label for="book_subject">Subject</label>:
<%= collection_select(:book, :subject_id,
                         Subject.all, :id, :name) %></p>
---
SELECT `subjects`.* FROM `subjects`