app/views/books/index.html.erb

SELECT `books`.* FROM `books`
---

              <% book.user_books.each do |w| %>