app/views/books/new.html.erb

SELECT `subjects`.* FROM `subjects`
---
<p><label for="book_subject">Subject</label>:
<%= collection_select(:book,:subject_id, Subject.all,:id,:name) %></p>