app/controllers/books_controller.rb

SELECT `books`.* FROM `books`
---
  def index
    if params.has_key?(:search) && params[:search].strip != ""     #for rental search across site
       @books = Book.search(params[:search], :match_mode => :any, :star => true, :page => params[:page], :per_page => 10)

SELECT `books`.* FROM `books` WHERE `books`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @book = Book.find(params[:id])#666

INSERT INTO `books` (`created_at`, `description`, `price`, `subject_id`, `title`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save