app/controllers/users_controller.rb

  def index
     @users = User.paginate(:page => params[:page], :per_page => 10)
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`admin`, `created_at`, `email`, `name`, `password_digest`, `remember_token`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `password_digest` = '$2a$10$dCPsgNVTXhY4xzvlLZKeXelMMBajXDm.IZ.6GPImgH0IfKket8LUe', `remember_token` = 'ILAoG_B70s9fXLp71Fm6bg', `updated_at` = '2012-08-11 00:16:31' WHERE `users`.`id` = 104